package day01_环境准备;

public class day02_1题目 {
    //题目链接：
    // https://t.zsxq.com/6QnMJqV

    //21天Java打卡，第1期第2天0809_基础名词+输入输出
    //
    //【基础名词】
    //1、注释
    // 单行注释：//
    // 多行注释：/*    */
    // 文档注释：/**    */
    //
    //2、关键字
    //① 什么是关键字
    // 被Java语言赋予特定含义的单词
    //
    //② 关键字的特点
    // 组成关键字的字母全部小写
    //
    //③ 常见关键字
    // public static void class等
    //
    //3、标识符
    //① 标识符的组成规则
    // 英文大小写字母
    // 数字字符
    // $和_
    //
    //② 标识符注意事项
    // 1,不能使用关键字
    // 2,不能数字开头
    //
    //【输入和输出】
    //题目：设计一个程序，输入上次考试成绩（int）和本次考试成绩（int），然后输出成绩提高的百分比，保留两位小数位。
}
